# ContainsSharedSameNameFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ContainsSharedSameNameFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family '[Family Name]' contains a shared family of the same name. Please rename one of the two families before loading!
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContainsSharedSameNameFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContainsSharedSameNameFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContainsSharedSameNameFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace